/*
给你两个按 非递减顺序 排列的整数数组 nums1 和 nums2，另有两个整数 m 和 n ，分别表示 nums1 和 nums2 中的元素数目。

请你 合并 nums2 到 nums1 中，使合并后的数组同样按 非递减顺序 排列。

注意：最终，合并后数组不应由函数返回，而是存储在数组 nums1 中。为了应对这种情况，nums1 的初始长度为 m + n，其中前 m 个元素表示应合并的元素，后 n 个元素为 0 ，应忽略。nums2 的长度为 n 。

 

示例 1：

输入：nums1 = [1,2,3,0,0,0], m = 3, nums2 = [2,5,6], n = 3
输出：[1,2,2,3,5,6]
解释：需要合并 [1,2,3] 和 [2,5,6] 。
合并结果是 [1,2,2,3,5,6] ，其中斜体加粗标注的为 nums1 中的元素。
示例 2：

输入：nums1 = [1], m = 1, nums2 = [], n = 0
输出：[1]
解释：需要合并 [1] 和 [] 。
合并结果是 [1] 。
示例 3：

输入：nums1 = [0], m = 0, nums2 = [1], n = 1
输出：[1]
解释：需要合并的数组是 [] 和 [1] 。
合并结果是 [1] 。
注意，因为 m = 0 ，所以 nums1 中没有元素。nums1 中仅存的 0 仅仅是为了确保合并结果可以顺利存放到 nums1 中。
*/

/*
 * LeetCode 88. Merge Sorted Array
 * 解法：双指针从后往前。nums1后半部分是空位，从末尾开始填充较大元素。
 *       利用特性：若nums2先耗尽，nums1剩余元素已在原位，无需操作。
 * 时间复杂度：O(m+n)，空间复杂度：O(1)
 */
 //思路,将右边的数塞进左边,还要求有序,搬右边的和左边进行比较,然后写入,从前往后写会破坏数据,从后往前写覆盖0即可,同时奠定比谁大搬谁,肯定要写循环去搬,循环非固定次数,而是看p2有没有搬空,用while来判断
 void merge(int* nums1, int nums1Size, int m, int* nums2, int nums2Size, int n) {
    if (n == 0) return;  // 防御：nums2为空，无需操作
    
    int p1 = m - 1;      // nums1有效元素末尾
    int p2 = n - 1;      // nums2末尾
    int write = m + n - 1;  // nums1写入位置（从末尾开始）,找到位置后写入所以叫write
    
    while (p2 >= 0) {    // nums2没耗尽就继续,隐式保护了p2
        if (p1 >= 0 && nums1[p1] > nums2[p2]) {   //p1未保护,所以要写p1 > 0再判断,心里默念当第一个仓库还有东西且第一个仓库大于第二个仓库搬第一个仓库否则搬第二个仓库
            nums1[write--] = nums1[p1--];       //每搬一个少一个,然后拿下一个去比,所以p1要--
        } else {
            nums1[write--] = nums2[p2--];
        }
    }
}